tap "tasanakorn/esp32"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "eigen"
brew "gcc"
brew "libevent"
brew "open-mpi"
brew "arpack"
brew "bash-completion@2"
brew "berkeley-db", link: true
brew "boost"
brew "cairo"
brew "suite-sparse"
brew "tbb"
brew "ceres-solver"
brew "hdf5"
brew "cmake"
brew "dfu-util"
brew "docker"
brew "docker-compose"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "harfbuzz"
brew "pango"
brew "tesseract"
brew "ghostscript"
brew "python@3.13"
brew "libass"
brew "libbluray"
brew "srt"
brew "ffmpeg"
brew "fftw"
brew "netpbm"
brew "libavif"
brew "gd"
brew "geckodriver"
brew "git"
brew "git-gui"
brew "qt"
brew "gnuplot"
brew "go"
brew "gobject-introspection"
brew "shared-mime-info"
brew "libheif"
brew "graphicsmagick"
brew "huggingface-cli"
brew "libraw"
brew "imagemagick"
brew "libfido2"
brew "make"
brew "mecab"
brew "mecab-ipadic"
brew "mysql"
brew "netcdf"
brew "nghttp2"
brew "ninja"
brew "node"
brew "numpy"
brew "portaudio"
brew "pyqt"
brew "qscintilla2"
brew "sundials"
brew "octave"
brew "vtk"
brew "opencv"
brew "perl"
brew "protobuf@21"
brew "qt@5"
brew "pyqt@5"
brew "python@3.10"
brew "python@3.12"
brew "ruby-build"
brew "rbenv"
brew "ruby"
brew "rust"
brew "sip"
brew "vim"
brew "wget"
brew "yarn"
brew "zsh"
brew "zsh-completions"
brew "tasanakorn/esp32/xtensa-esp32-elf"
cask "chromedriver"
cask "qmk-toolbox"
vscode "1yib.rust-bundle"
vscode "alexcvzz.vscode-sqlite"
vscode "amodio.tsl-problem-matcher"
vscode "anthropic.claude-code"
vscode "bierner.markdown-preview-github-styles"
vscode "castwide.solargraph"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "espressif.esp-idf-extension"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "genieai.chatgpt-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "grapecity.gc-excelviewer"
vscode "jithurjacob.nbpreviewer"
vscode "kaiwood.endwise"
vscode "kaysonwu.cpptask"
vscode "kleber-swf.unity-code-snippets"
vscode "leetcode.vscode-leetcode"
vscode "misogi.ruby-rubocop"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.extension-test-runner"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-serial-monitor"
vscode "msyrus.go-doc"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mssql"
vscode "mtxr.sqltools-driver-mysql"
vscode "mtxr.sqltools-driver-pg"
vscode "mtxr.sqltools-driver-sqlite"
vscode "oderwat.indent-rainbow"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-lsp"
vscode "tabnine.tabnine-vscode"
vscode "techtrain.railway-vscode"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "vscodevim.vim"
vscode "wakatime.vscode-wakatime"
vscode "zainchen.json"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/ramya-rao-a/go-outline"
go "golang.org/x/lint/golint"
go "github.com/fatih/gomodifytags"
go "github.com/uudashr/gopkgs/v2/cmd/gopkgs"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/josharian/impl"
